app/views/parking_spaces/index.html.erb

      <tr>
        <td><%= User.find(parking_space.user_id).username %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]