app/views/parking_spaces/search.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <tr>
      <td><%= User.find(result.user_id).username %></td>