app/controllers/parking_spaces_controller.rb

SELECT "parking_spaces".* FROM "parking_spaces"
---
  def index
    @posts = ParkingSpace.all

SELECT "parking_spaces".* FROM "parking_spaces"
---
  def search
    if params[:search].blank?
      @search_term = 'N/A'
      @results = ParkingSpace.all