app/controllers/posts_controller.rb

  def search
    if params[:search].blank?
      @search_term = 'N/A'
      @results = Post.all
---
SELECT "posts".* FROM "posts" WHERE (lower(title) LIKE '%test%' OR lower(address) LIKE '%test%' OR lower(body) LIKE '%test%' OR lower(posted_by) LIKE '%test%')

  def create
    @post = Post.new(post_params)
    @post.posted_by = current_user.username
    @post.email = current_user.email

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "address", "cost", "email") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "1"], ["body", "4"], ["created_at", "2019-01-28 12:36:59.167456"], ["updated_at", "2019-01-28 12:36:59.167456"], ["address", "2"], ["cost", 3.0], ["email", "tynan.matthews2@parkpnp.com"]]